EWSEditor/EwsPostExamples/CreateFolderPath.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types"
               xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages">
  <soap:Header>
    <t:RequestServerVersion Version="Exchange2013" />
    <t:MailboxCulture>en-US</t:MailboxCulture>
    <t:TimeZoneContext>
      <t:TimeZoneDefinition Id="GMT Standard Time"/>
    </t:TimeZoneContext>
  </soap:Header>
  <soap:Body >
    <m:CreateFolderPath>
      <m:ParentFolderId>
        <t:DistinguishedFolderId Id="inbox"/>
      </m:ParentFolderId>
      <m:RelativeFolderPath>
        <t:Folder>
          <t:DisplayName>MyFirstLevelFolder</t:DisplayName>
        </t:Folder>
        <t:Folder>
          <t:DisplayName>MySecondLevelFolder</t:DisplayName>
        </t:Folder>
        <t:Folder>
          <t:DisplayName>MyThirdLevelFolder</t:DisplayName>
        </t:Folder>
      </m:RelativeFolderPath>
    </m:CreateFolderPath>
  </soap:Body>
</soap:Envelope>